var data = {
    engine:
        {
            name: "Engine",
            tooltip: "Діагностика силового агрегату та трансміссії",
            description: "Діагностика та ремонт електронних компонентів, які стосуються двигуна та трансмісії.\n" +
            "- Засвітився чек?\n" +
            "- Немає потужності?\n" +
            "- Не рівно працює?\n" +
            "- Двигун на запускається?\n" +
            "- Надмірне споживання пального?\n" +
            "- Вийшов з ладу блок керування двигуном?\n" +
            "Заповніть заявку"
        },
    odo:
        {
            name: "ODO",
            tooltip: "Коррекція одометрів",
            description: "Коррекція показників одометра після заміниб конвертація з миль в км, фаренгейтів в цельсії, ремонт.\n" +
            "- Погасли показники одометра?\n" +
            "- Замінили панель приладів?\n" +
            "Заповніть заявку"
        },
    srs:
        {
            name: "SRS",
            tooltip: "Діагностика та ремонт блоків SRS",
            description: "Діагностика та ремонт, відновлення після ДТП (Crash Data) блокыв керування подушок безпеки.\n" +
            "- З\"явилась іконка SRS на панелі?\n" +
            "- Авто побувало у ДТП?\n" +
            "Заповніть заявку"
        },
    immo:
        {
            name: "IMMO",
            tooltip: "Все що стосується систем іммобілайзерів",
            description: "Діагностика та ремонт електронних систем іммобілайзера, виготовлення та адаптація чіпів і ключах, видалення з пам\"яті втрачених ключів.\n" +
            "- Авто не заводиться?\n" +
            "- Засвітився індикатор іммобілайзера?\n" +
            "- Втратили ключі від авто?\n" +
            "- Бажаєте мати ще один ключ?\n" +
            "Заповніть заявку"
        },
    abs:
        {
            name: "ABS/ESP",
            tooltip: "Обслуговування електроніки гальмівної системи",
            description: "Діагностика та ремонт електроніки гальмівної системи.\n" +
            "- Засвітився індикатор ABS/ESP ?\n" +
            "- Некорректна робота системи ABS/ESP ?\n" +
            "- Вийшов з ладу блок керування ABS?\n" +
            "Заповніть заявку"
        },
    ecu:
        {
            name: "ECU",
            tooltip: "Ремонт електронних блоків авто",
            description: "Діагностика та ремонт електронних блоків керування. Адаптація та налаштування нових блоків після заміни. Оновлення ПЗ.\n" +
            "- Вийшов з ладу блок керування?\n" +
            "- Не вдається адаптувати новій чи бувший в користуванні блок?\n" +
            "Заповніть заявку."
        },
    ps:
        {
            name: "PS",
            tooltip: "Все, що стосується програмного забезпечення авто",
            description: "Оновлення та заміна програмного забезпечення. Кодування та модифікація комплектації авто. Адаптація мови.\n" +
            "- Дообладнали авто і потрібно змінити комплектацію?\n" +
            "- Замінили блок і він працює не правильно?\n" +
            "- Бажаєте мати останню версію ПЗ?\n" +
            "Заповніть заявку."
        },
    dpf:
        {
            name: "DPF\\FAP\\ADDBlue\\CAT",
            tooltip: "Програмне видалення сажових фільтрів, каталізаторів",
            description: "Програмне видалення сажевіих фільтрів, каталізаторів, присадок AddBlue, Olys та інше.\n" +
            "- Сажевий фільтр не працює?\n" +
            "- Авто в аварійному режимі по вині DPF?\n" +
            "- Каталізатор сплавився?\n" +
            "Заповніть заявку."
        }





};

var sheet = ['engine', 'odo', 'srs', 'immo','abs', 'ecu', 'ps', 'dpf'];

var isLogined = function(){
  return false;
};

sheet.forEach(function (value) {  new Vue({
    el: '#' + value,
    data: {
        href: "",
        message: data[value].name,
        message2: data[value].tooltip
    },
    methods:{
        getHref(){
            isLogined()? this.href = "request.html" : this.href = "form.html";
        }
    }


})});